<?xml version="1.0"?>
<net name="tf2onnx" version="11">
	<layers>
		<layer id="0" name="input_tensor" type="Parameter" version="opset1">
			<data shape="1,?,?,3" element_type="u8" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f32" />
			</rt_info>
			<output>
				<port id="0" precision="U8" names="input_tensor">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="StatefulPartitionedCall/map/while/maximum_iterations:0" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/map/while/maximum_iterations:0" />
			</output>
		</layer>
		<layer id="2" name="__inference_map_while_cond_7737_2836_map/while/LogicalAnd" type="Const" version="opset1">
			<data element_type="boolean" shape="" offset="8" size="1" />
			<output>
				<port id="0" precision="BOOL" names="__inference_map_while_cond_7737_2836_map/while/LogicalAnd:0" />
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/map/Const:0" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="9" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/map/Const:0" />
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/map/while_loop" type="Loop" version="opset5">
			<port_map>
				<input external_port_id="2" internal_layer_id="1" />
				<input external_port_id="3" internal_layer_id="0" />
				<output axis="0" external_port_id="4" internal_layer_id="47" start="0" end="-1" stride="1" part_size="1" />
				<output axis="0" external_port_id="5" internal_layer_id="45" start="0" end="-1" stride="1" part_size="1" />
				<input external_port_id="-1" internal_layer_id="2" purpose="current_iteration" />
				<output external_port_id="-1" internal_layer_id="60" purpose="execution_condition" />
			</port_map>
			<back_edges>
				<edge from-layer="50" to-layer="1" />
			</back_edges>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="BOOL" />
				<port id="2" precision="I32" />
				<port id="3" precision="U8">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32" names="StatefulPartitionedCall/map/while_loop:1">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
				<port id="5" precision="FP32" names="StatefulPartitionedCall/map/while_loop:2">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
				</port>
			</output>
			<body>
				<layers>
					<layer id="2" name="map_while_map_while_loop_counter:0" type="Parameter" version="opset1">
						<data shape="" element_type="i64" />
						<output>
							<port id="0" precision="I64" names="map_while_map_while_loop_counter:0" />
						</output>
					</layer>
					<layer id="1" name="map_while_placeholder:0" type="Parameter" version="opset1">
						<data shape="" element_type="i32" />
						<output>
							<port id="0" precision="I32" names="map_while_placeholder:0" />
						</output>
					</layer>
					<layer id="0" name="Parameter_309" type="Parameter" version="opset1">
						<data shape="1,?,?,3" element_type="u8" />
						<output>
							<port id="0" precision="U8">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="3" name="Constant_30055_compressed" type="Const" version="opset1">
						<data element_type="f16" shape="1, 1, 1, 1" offset="13" size="2" />
						<output>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="4" name="Constant_30055" type="Convert" version="opset1">
						<data destination_type="f32" />
						<rt_info>
							<attribute name="decompression" version="0" />
						</rt_info>
						<input>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="5" name="Constant_310" type="Const" version="opset1">
						<data element_type="i64" shape="" offset="15" size="8" />
						<output>
							<port id="0" precision="I64" />
						</output>
					</layer>
					<layer id="6" name="map/while/TensorArrayV2Read/TensorListGetItem" type="Gather" version="opset8">
						<data batch_dims="0" />
						<input>
							<port id="0" precision="U8">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I32" />
							<port id="2" precision="I64" />
						</input>
						<output>
							<port id="3" precision="U8" names="map/while/TensorArrayV2Read/TensorListGetItem:0">
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="7" name="map/while/Cast" type="Convert" version="opset1">
						<data destination_type="f32" />
						<input>
							<port id="0" precision="U8">
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP32" names="map/while/Cast:0">
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="8" name="const_axes__36" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="15" size="8" />
						<output>
							<port id="0" precision="I64" names="const_axes__36">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="9" name="Unsqueeze__37" type="Unsqueeze" version="opset1">
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32" names="Unsqueeze__37:0">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="10" name="begin_masked__40" type="Const" version="opset1">
						<data element_type="i32" shape="4" offset="23" size="16" />
						<output>
							<port id="0" precision="I32" names="begin_masked__40">
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="11" name="end_masked__41" type="Const" version="opset1">
						<data element_type="i32" shape="4" offset="39" size="16" />
						<output>
							<port id="0" precision="I32" names="end_masked__41">
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="12" name="map/while/strided_slice/stack_2:0" type="Const" version="opset1">
						<data element_type="i32" shape="4" offset="55" size="16" />
						<output>
							<port id="0" precision="I32" names="map/while/strided_slice/stack_2:0">
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="13" name="slice_axes__42" type="Const" version="opset1">
						<data element_type="i32" shape="4" offset="71" size="16" />
						<output>
							<port id="0" precision="I32" names="slice_axes__42">
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="14" name="map/while/strided_slice" type="Slice" version="opset8">
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I32">
								<dim>4</dim>
							</port>
							<port id="2" precision="I32">
								<dim>4</dim>
							</port>
							<port id="3" precision="I32">
								<dim>4</dim>
							</port>
							<port id="4" precision="I32">
								<dim>4</dim>
							</port>
						</input>
						<output>
							<port id="5" precision="FP32" names="map/while/strided_slice:0">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="15" name="map/while/Preprocessor/mul" type="Multiply" version="opset1">
						<data auto_broadcast="numpy" />
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32" names="map/while/Preprocessor/mul:0">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="16" name="Constant_30056_compressed" type="Const" version="opset1">
						<data element_type="f16" shape="1, 1, 1, 1" offset="87" size="2" />
						<output>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="17" name="Constant_30056" type="Convert" version="opset1">
						<data destination_type="f32" />
						<rt_info>
							<attribute name="decompression" version="0" />
						</rt_info>
						<input>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="18" name="map/while/Preprocessor/sub" type="Add" version="opset1">
						<data auto_broadcast="numpy" />
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32" names="map/while/Preprocessor/sub:0,map/while/Preprocessor/unstack:0">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="19" name="Constant_324" type="Const" version="opset1">
						<data element_type="i64" shape="4" offset="89" size="32" />
						<output>
							<port id="0" precision="I64">
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="20" name="Transpose__49" type="Transpose" version="opset1">
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I64">
								<dim>4</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32" names="Transpose__49:0">
								<dim>1</dim>
								<dim>3</dim>
								<dim>-1</dim>
								<dim>-1</dim>
							</port>
						</output>
					</layer>
					<layer id="21" name="Shape__55" type="ShapeOf" version="opset3">
						<data output_type="i64" />
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>3</dim>
								<dim>-1</dim>
								<dim>-1</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="I64" names="Shape__55:0">
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="22" name="const_zero__52" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="15" size="8" />
						<rt_info>
							<attribute name="precise" version="0" />
						</rt_info>
						<output>
							<port id="0" precision="I64" names="const_zero__52">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="23" name="const_two__53" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="121" size="8" />
						<rt_info>
							<attribute name="precise" version="0" />
						</rt_info>
						<output>
							<port id="0" precision="I64" names="const_two__53">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="24" name="Broadcast_329" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="0" size="8" />
						<rt_info>
							<attribute name="precise" version="0" />
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="25" name="Constant_334" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="15" size="8" />
						<rt_info>
							<attribute name="precise" version="0" />
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="26" name="Slice__58" type="Slice" version="opset8">
						<input>
							<port id="0" precision="I64">
								<dim>4</dim>
							</port>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
							<port id="2" precision="I64">
								<dim>1</dim>
							</port>
							<port id="3" precision="I64">
								<dim>1</dim>
							</port>
							<port id="4" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="5" precision="I64" names="Slice__58:0">
								<dim>2</dim>
							</port>
						</output>
					</layer>
					<layer id="27" name="const_fold_opt__1425" type="Const" version="opset1">
						<data element_type="i64" shape="2" offset="129" size="16" />
						<rt_info>
							<attribute name="precise" version="0" />
						</rt_info>
						<output>
							<port id="0" precision="I64" names="const_fold_opt__1425">
								<dim>2</dim>
							</port>
						</output>
					</layer>
					<layer id="28" name="Concat__60" type="Concat" version="opset1">
						<data axis="0" />
						<input>
							<port id="0" precision="I64">
								<dim>2</dim>
							</port>
							<port id="1" precision="I64">
								<dim>2</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="I64" names="Concat__60:0">
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="29" name="Resize__61" type="Interpolate" version="opset11">
						<data mode="linear_onnx" shape_calculation_mode="sizes" coordinate_transformation_mode="asymmetric" nearest_mode="floor" antialias="false" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" cube_coeff="-0.75" />
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>3</dim>
								<dim>-1</dim>
								<dim>-1</dim>
							</port>
							<port id="1" precision="I64">
								<dim>4</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32" names="Resize__61:0">
								<dim>1</dim>
								<dim>3</dim>
								<dim>320</dim>
								<dim>320</dim>
							</port>
						</output>
					</layer>
					<layer id="30" name="axes_const__64__1301" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="15" size="8" />
						<output>
							<port id="0" precision="I64" names="axes_const__64__1301">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="31" name="map/while/Preprocessor/ResizeImage/resize/Squeeze" type="Squeeze" version="opset1">
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>3</dim>
								<dim>320</dim>
								<dim>320</dim>
							</port>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32" names="map/while/Preprocessor/ResizeImage/resize/Squeeze:0">
								<dim>3</dim>
								<dim>320</dim>
								<dim>320</dim>
							</port>
						</output>
					</layer>
					<layer id="32" name="const_fold_opt__1427__1429" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="0" size="8" />
						<output>
							<port id="0" precision="I64" names="const_fold_opt__1427__1429">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="33" name="map/while/Preprocessor/stack" type="Unsqueeze" version="opset1">
						<input>
							<port id="0" precision="FP32">
								<dim>3</dim>
								<dim>320</dim>
								<dim>320</dim>
							</port>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32" names="map/while/Preprocessor/stack:0">
								<dim>3</dim>
								<dim>1</dim>
								<dim>320</dim>
								<dim>320</dim>
							</port>
						</output>
					</layer>
					<layer id="34" name="const_starts__68" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="15" size="8" />
						<output>
							<port id="0" precision="I64" names="const_starts__68">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="35" name="const_ends__69" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="0" size="8" />
						<output>
							<port id="0" precision="I64" names="const_ends__69">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="36" name="Broadcast_347" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="0" size="8" />
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="37" name="const_axes__70" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="0" size="8" />
						<output>
							<port id="0" precision="I64" names="const_axes__70">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="38" name="map/while/strided_slice_1" type="Slice" version="opset8">
						<input>
							<port id="0" precision="FP32">
								<dim>3</dim>
								<dim>1</dim>
								<dim>320</dim>
								<dim>320</dim>
							</port>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
							<port id="2" precision="I64">
								<dim>1</dim>
							</port>
							<port id="3" precision="I64">
								<dim>1</dim>
							</port>
							<port id="4" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="5" precision="FP32" names="map/while/strided_slice_1:0">
								<dim>3</dim>
								<dim>1</dim>
								<dim>320</dim>
								<dim>320</dim>
							</port>
						</output>
					</layer>
					<layer id="39" name="Constant_26584" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="0" size="8" />
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="40" name="Squeeze_26585" type="Squeeze" version="opset1">
						<input>
							<port id="0" precision="FP32">
								<dim>3</dim>
								<dim>1</dim>
								<dim>320</dim>
								<dim>320</dim>
							</port>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>3</dim>
								<dim>320</dim>
								<dim>320</dim>
							</port>
						</output>
					</layer>
					<layer id="41" name="Constant_26586" type="Const" version="opset1">
						<data element_type="i64" shape="3" offset="145" size="24" />
						<output>
							<port id="0" precision="I64">
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="42" name="map/while/TensorArrayV2Write/TensorListSetItem_raw_output___9:0" type="Transpose" version="opset1">
						<input>
							<port id="0" precision="FP32">
								<dim>3</dim>
								<dim>320</dim>
								<dim>320</dim>
							</port>
							<port id="1" precision="I64">
								<dim>3</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32" names="map/while/TensorArrayV2Write/TensorListSetItem_raw_output___9:0">
								<dim>320</dim>
								<dim>320</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="43" name="Constant_361" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="15" size="8" />
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="44" name="Unsqueeze_363" type="Unsqueeze" version="opset1">
						<input>
							<port id="0" precision="FP32">
								<dim>320</dim>
								<dim>320</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>320</dim>
								<dim>320</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="46" name="Unsqueeze_362" type="Const" version="opset1">
						<data element_type="i32" shape="1, 3" offset="169" size="12" />
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="48" name="map/while/add/y:0" type="Const" version="opset1">
						<data element_type="i32" shape="" offset="181" size="4" />
						<output>
							<port id="0" precision="I32" names="map/while/add/y:0" />
						</output>
					</layer>
					<layer id="49" name="map/while/add:0" type="Add" version="opset1">
						<data auto_broadcast="numpy" />
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I32" />
						</input>
						<output>
							<port id="2" precision="I32" names="map/while/add:0" />
						</output>
					</layer>
					<layer id="51" name="cond___map/while/Less_1__32" type="Convert" version="opset1">
						<data destination_type="f32" />
						<input>
							<port id="0" precision="I64" />
						</input>
						<output>
							<port id="1" precision="FP32" names="cond___map/while/Less_1__32:0" />
						</output>
					</layer>
					<layer id="52" name="const_fold_opt__1433_compressed" type="Const" version="opset1">
						<data element_type="f16" shape="" offset="185" size="2" />
						<output>
							<port id="0" precision="FP16" names="const_fold_opt__1433" />
						</output>
					</layer>
					<layer id="53" name="const_fold_opt__1433" type="Convert" version="opset1">
						<data destination_type="f32" />
						<rt_info>
							<attribute name="decompression" version="0" />
						</rt_info>
						<input>
							<port id="0" precision="FP16" />
						</input>
						<output>
							<port id="1" precision="FP32" />
						</output>
					</layer>
					<layer id="54" name="cond___map/while/Less_1" type="Less" version="opset1">
						<data auto_broadcast="numpy" />
						<input>
							<port id="0" precision="FP32" />
							<port id="1" precision="FP32" />
						</input>
						<output>
							<port id="2" precision="BOOL" names="cond___map/while/Less_1:0" />
						</output>
					</layer>
					<layer id="55" name="cond___map/while/Less__34" type="Convert" version="opset1">
						<data destination_type="f32" />
						<input>
							<port id="0" precision="I32" />
						</input>
						<output>
							<port id="1" precision="FP32" names="cond___map/while/Less__34:0" />
						</output>
					</layer>
					<layer id="56" name="const_fold_opt__1428_compressed" type="Const" version="opset1">
						<data element_type="f16" shape="" offset="185" size="2" />
						<output>
							<port id="0" precision="FP16" names="const_fold_opt__1428" />
						</output>
					</layer>
					<layer id="57" name="const_fold_opt__1428" type="Convert" version="opset1">
						<data destination_type="f32" />
						<rt_info>
							<attribute name="decompression" version="0" />
						</rt_info>
						<input>
							<port id="0" precision="FP16" />
						</input>
						<output>
							<port id="1" precision="FP32" />
						</output>
					</layer>
					<layer id="58" name="cond___map/while/Less" type="Less" version="opset1">
						<data auto_broadcast="numpy" />
						<input>
							<port id="0" precision="FP32" />
							<port id="1" precision="FP32" />
						</input>
						<output>
							<port id="2" precision="BOOL" names="cond___map/while/Less:0" />
						</output>
					</layer>
					<layer id="59" name="cond___map/while/LogicalAnd_graph_outputs_Identity__4:0" type="LogicalAnd" version="opset1">
						<data auto_broadcast="numpy" />
						<input>
							<port id="0" precision="BOOL" />
							<port id="1" precision="BOOL" />
						</input>
						<output>
							<port id="2" precision="BOOL" names="cond___map/while/LogicalAnd_graph_outputs_Identity__4:0" />
						</output>
					</layer>
					<layer id="60" name="Result_364" type="Result" version="opset1">
						<input>
							<port id="0" precision="BOOL" />
						</input>
					</layer>
					<layer id="50" name="Result_365" type="Result" version="opset1">
						<input>
							<port id="0" precision="I32" />
						</input>
					</layer>
					<layer id="47" name="Result_366" type="Result" version="opset1">
						<input>
							<port id="0" precision="I32">
								<dim>1</dim>
								<dim>3</dim>
							</port>
						</input>
					</layer>
					<layer id="45" name="Result_367" type="Result" version="opset1">
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>320</dim>
								<dim>320</dim>
								<dim>3</dim>
							</port>
						</input>
					</layer>
				</layers>
				<edges>
					<edge from-layer="0" from-port="0" to-layer="6" to-port="0" />
					<edge from-layer="1" from-port="0" to-layer="49" to-port="0" />
					<edge from-layer="1" from-port="0" to-layer="6" to-port="1" />
					<edge from-layer="2" from-port="0" to-layer="51" to-port="0" />
					<edge from-layer="3" from-port="0" to-layer="4" to-port="0" />
					<edge from-layer="4" from-port="1" to-layer="15" to-port="0" />
					<edge from-layer="5" from-port="0" to-layer="6" to-port="2" />
					<edge from-layer="6" from-port="3" to-layer="7" to-port="0" />
					<edge from-layer="7" from-port="1" to-layer="9" to-port="0" />
					<edge from-layer="8" from-port="0" to-layer="9" to-port="1" />
					<edge from-layer="9" from-port="2" to-layer="14" to-port="0" />
					<edge from-layer="10" from-port="0" to-layer="14" to-port="1" />
					<edge from-layer="11" from-port="0" to-layer="14" to-port="2" />
					<edge from-layer="12" from-port="0" to-layer="14" to-port="3" />
					<edge from-layer="13" from-port="0" to-layer="14" to-port="4" />
					<edge from-layer="14" from-port="5" to-layer="15" to-port="1" />
					<edge from-layer="15" from-port="2" to-layer="18" to-port="0" />
					<edge from-layer="16" from-port="0" to-layer="17" to-port="0" />
					<edge from-layer="17" from-port="1" to-layer="18" to-port="1" />
					<edge from-layer="18" from-port="2" to-layer="20" to-port="0" />
					<edge from-layer="19" from-port="0" to-layer="20" to-port="1" />
					<edge from-layer="20" from-port="2" to-layer="29" to-port="0" />
					<edge from-layer="20" from-port="2" to-layer="21" to-port="0" />
					<edge from-layer="21" from-port="1" to-layer="26" to-port="0" />
					<edge from-layer="22" from-port="0" to-layer="26" to-port="1" />
					<edge from-layer="23" from-port="0" to-layer="26" to-port="2" />
					<edge from-layer="24" from-port="0" to-layer="26" to-port="3" />
					<edge from-layer="25" from-port="0" to-layer="26" to-port="4" />
					<edge from-layer="26" from-port="5" to-layer="28" to-port="0" />
					<edge from-layer="27" from-port="0" to-layer="28" to-port="1" />
					<edge from-layer="28" from-port="2" to-layer="29" to-port="1" />
					<edge from-layer="29" from-port="2" to-layer="31" to-port="0" />
					<edge from-layer="30" from-port="0" to-layer="31" to-port="1" />
					<edge from-layer="31" from-port="2" to-layer="33" to-port="0" />
					<edge from-layer="32" from-port="0" to-layer="33" to-port="1" />
					<edge from-layer="33" from-port="2" to-layer="38" to-port="0" />
					<edge from-layer="34" from-port="0" to-layer="38" to-port="1" />
					<edge from-layer="35" from-port="0" to-layer="38" to-port="2" />
					<edge from-layer="36" from-port="0" to-layer="38" to-port="3" />
					<edge from-layer="37" from-port="0" to-layer="38" to-port="4" />
					<edge from-layer="38" from-port="5" to-layer="40" to-port="0" />
					<edge from-layer="39" from-port="0" to-layer="40" to-port="1" />
					<edge from-layer="40" from-port="2" to-layer="42" to-port="0" />
					<edge from-layer="41" from-port="0" to-layer="42" to-port="1" />
					<edge from-layer="42" from-port="2" to-layer="44" to-port="0" />
					<edge from-layer="43" from-port="0" to-layer="44" to-port="1" />
					<edge from-layer="44" from-port="2" to-layer="45" to-port="0" />
					<edge from-layer="46" from-port="0" to-layer="47" to-port="0" />
					<edge from-layer="48" from-port="0" to-layer="49" to-port="1" />
					<edge from-layer="49" from-port="2" to-layer="50" to-port="0" />
					<edge from-layer="49" from-port="2" to-layer="55" to-port="0" />
					<edge from-layer="51" from-port="1" to-layer="54" to-port="0" />
					<edge from-layer="52" from-port="0" to-layer="53" to-port="0" />
					<edge from-layer="53" from-port="1" to-layer="54" to-port="1" />
					<edge from-layer="54" from-port="2" to-layer="59" to-port="0" />
					<edge from-layer="55" from-port="1" to-layer="58" to-port="0" />
					<edge from-layer="56" from-port="0" to-layer="57" to-port="0" />
					<edge from-layer="57" from-port="1" to-layer="58" to-port="1" />
					<edge from-layer="58" from-port="2" to-layer="59" to-port="1" />
					<edge from-layer="59" from-port="2" to-layer="60" to-port="0" />
				</edges>
				<rt_info />
			</body>
		</layer>
		<layer id="5" name="Constant_459" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="89" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/Conv1/Conv2D__74" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/Conv1/Conv2D__74:0">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/Conv1/Conv2D_weights_fused_bn_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 3, 3, 3" offset="187" size="1728" />
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/Conv1/Conv2D_weights_fused_bn">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/Conv1/Conv2D_weights_fused_bn" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/Conv1/Conv2D/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Reshape_473_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="1915" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Reshape_473" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/Conv1/Conv2D" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/bn_Conv1/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/Conv1_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/Conv1_relu/Relu6:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_486_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 3, 3" offset="1979" size="576" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Reshape_486" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_depthwise/depthwise/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Reshape_538_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="2555" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Reshape_538" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_depthwise/depthwise" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_depthwise_BN/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_depthwise_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_depthwise_relu/Relu6:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_project/Conv2D_weights_fused_bn_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 32, 1, 1" offset="2619" size="1024" />
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_project/Conv2D_weights_fused_bn">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_project/Conv2D_weights_fused_bn" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_project/Conv2D/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Reshape_556_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="3643" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Reshape_556" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_project/Conv2D" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_project_BN/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand/Conv2D_weights_fused_bn_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 16, 1, 1" offset="3675" size="3072" />
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand/Conv2D_weights_fused_bn">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand/Conv2D_weights_fused_bn" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand/Conv2D/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Reshape_572_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 96, 1, 1" offset="6747" size="192" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Reshape_572" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand/Conv2D" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand_BN/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand_relu/Relu6:0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Reshape_585_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 1, 1, 3, 3" offset="6939" size="1728" />
			<output>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Reshape_585" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_depthwise/depthwise/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Reshape_637_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 96, 1, 1" offset="8667" size="192" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Reshape_637" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_depthwise/depthwise" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_depthwise_BN/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_depthwise_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_depthwise_relu/Relu6:0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_project/Conv2D_weights_fused_bn_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="24, 96, 1, 1" offset="8859" size="4608" />
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_project/Conv2D_weights_fused_bn">
